rf-eng/micropython/ports/stm32/machine_i2s.c
// note:  must check queue is not empty before calling TODO ...thread safe?
//  TODO return NULL when queue is empty
STATIC mp_obj_t dequeue(machine_i2s_queue_t *queue) {
    mp_obj_t tmp = queue->buffers[queue->head];
    queue->head = (queue->head + 1) % QUEUE_CAPACITY;
    queue->size = queue->size - 1;
    return tmp;
}

STATIC bool isEmpty(machine_i2s_queue_t *queue) {
    return (bool)(queue->size == 0);
}


STATIC bool isFull(machine_i2s_queue_t *queue) {
    return (bool)(queue->size == QUEUE_CAPACITY);
}

//  For 32-bit audio samples, the STM32 HAL API expects each 32-bit sample to be encoded 
//  in an unusual byte ordering:  Byte_2, Byte_3, Byte_0, Byte_1
//      where:  Byte_0 is the least significant byte of the 32-bit sample
//
//  The following function takes a buffer containing 32-bits sample values formatted as little endian 
//  and performs an in-place modification into the STM32 HAL API convention
//
//  Example:
//
//   little_endian[] = [L_0-7,   L_8-15,  L_16-23, L_24-31, R_0-7,   R_8-15,  R_16-23, R_24-31] =  [Left channel, Right channel]           
//   stm_api[] =       [L_16-23, L_24-31, L_0-7,   L_8-15,  R_16-23, R_24-31, R_0-7,   R_8-15] = [Left channel, Right channel]
//
//   where:
//      L_0-7 is the least significant byte of the 32 bit sample in the Left channel 
//      L_24-31 is the most significant byte of the 32 bit sample in the Left channel 
//
//   little_endian[] =  [0x99, 0xBB, 0x11, 0x22, 0x44, 0x55, 0xAB, 0x77] = [Left channel, Right channel]           
//   stm_api[] =        [0x11, 0x22, 0x99, 0xBB, 0xAB, 0x77, 0x44, 0x55] = [Left channel, Right channel]
//
//   where:
//      LEFT Channel =  0x99, 0xBB, 0x11, 0x22
//      RIGHT Channel = 0x44, 0x55, 0xAB, 0x77
STATIC void machine_i2s_reformat_32_bit_samples(int32_t *sample, uint32_t num_samples) {
    int16_t sample_ms;
    int16_t sample_ls;
    for (uint32_t i=0; i<num_samples; i++) {
        sample_ls = sample[i] & 0xFFFF;
        sample_ms = sample[i] >> 16;
        sample[i] = (sample_ls << 16) + sample_ms;
    }
}

// TODO investigate mp_sched_schedule(self->callback, self);
STATIC void i2s_handle_mp_callback(machine_i2s_obj_t *self) {
    if (self->callback != mp_const_none) {
        gc_lock();
        nlr_buf_t nlr;
        if (nlr_push(&nlr) == 0) {
            mp_call_function_1(self->callback, self);
            nlr_pop();
        } else {
            // Uncaught exception; disable the callback so it doesn't run again.
            self->callback = mp_const_none;
            // DMA_HandleTypeDef dma = self->tx_dma;
            // __HAL_DMA_DISABLE(&dma);
            printf("uncaught exception in I2S(%u) DMA interrupt handler\n", self->i2s_id);
            mp_obj_print_exception(&mp_plat_print, (mp_obj_t)nlr.ret_val);
        }
        gc_unlock();
    }
}


// Simplying assumptions:
//   - size of sample buffers is an integer multiple of dma buffer size
//   -  TODO  note:  size of 1/2 dma buffer needs to be a multiple of 8 bytes  (so 1/2 of buffer always
//      contains integer number of complete stereo frames @ 32 bits/sample)
STATIC void machine_i2s_empty_dma(machine_i2s_obj_t *self, machine_i2s_dma_buffer_ping_pong_t dma_ping_pong) {
    
    mp_buffer_info_t bufinfo;
    
    // is a sample buffer actively being filled?
    // if not try to pull one from the idle queue
    
    if (self->active_buffer == NULL) {  // TODO rename idle_buffer ?  
        // try to pull new sample buffer from the queue
        if (!isEmpty(&self->idle_queue)) {
            mp_obj_t sample_buffer = dequeue(&self->idle_queue);
            self->active_buffer = sample_buffer;
            self->active_buffer_index = 0;
        } else {
            // no samples to 
            // TODO (?) fill dma buffer with zeros as there was no sample data to fill it
            // this would produce silence audio when no more sample data is available
            return;
        }
    }
    
    uint16_t dma_buffer_index = 0;
    if (dma_ping_pong == TOP_HALF) {
        dma_buffer_index = 0;  
    } else { // BOTTOM_HALF
        dma_buffer_index = SIZEOF_DMA_BUFFER_IN_BYTES/2; 
    }
    
    // 32 bit samples need to be reformatted to match STM32 HAL API requirements for I2S
    // TODO  SIZEOF_DMA_BUFFER_IN_BYTES/2  <--- make a macro for this
    if (self->bits == I2S_DATAFORMAT_32B) {
        machine_i2s_reformat_32_bit_samples((int32_t *)&self->dma_buffer[dma_buffer_index], SIZEOF_DMA_BUFFER_IN_BYTES/2/4);
    }
    
    // copy a block of samples from the dma buffer to the active buffer.
    // mono format is implemented by duplicating each sample into both L and R channels.
    // (STM32 HAL API has a stereo I2S implementation, but not mono)
    
    mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);

    if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_16B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/4;  // TODO - really confusing -- fix
        uint16_t *dma_buffer_p = (uint16_t *)&self->dma_buffer[dma_buffer_index];

        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint16_t *active_buffer_p = (uint16_t *)temp2;

        for (uint32_t i=0; i<samples_to_copy; i++) {
            active_buffer_p[i] = dma_buffer_p[i*2]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;  // TODO - really confusing -- fix
        
    } else if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_32B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/8;
        uint32_t *dma_buffer_p = (uint32_t *)&self->dma_buffer[dma_buffer_index];
        
        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint32_t *active_buffer_p = (uint32_t *)temp2;
        
        for (uint32_t i=0; i<samples_to_copy; i++) {
            active_buffer_p[i] = dma_buffer_p[i*2]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;
        
    } else { // STEREO, both 16-bit and 32-bit
        memcpy(&((uint8_t *)bufinfo.buf)[self->active_buffer_index],
               &self->dma_buffer[dma_buffer_index], 
               SIZEOF_DMA_BUFFER_IN_BYTES/2);
        
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2;
    }
    
    // has active buffer been filled?
    if (self->active_buffer_index >= bufinfo.len) {
        // clear buffer and push to active queue

        // TODO clear a buffer somewhere (before being put back into idle queue?)
        // memset(bufinfo.buf, 0, bufinfo.len);
        enqueue(&self->active_queue, self->active_buffer);
        self->active_buffer = NULL;
        i2s_handle_mp_callback(self);  // TODO "handle" <-- get better word
    }
}

// Simplying assumptions:
//   - size of sample buffers is an integer multiple of dma buffer size
//   -  TODO  note:  size of 1/2 dma buffer needs to be a multiple of 8 bytes  (so 1/2 of buffer always
//      contains integer number of complete stereo frames @ 32 bits/sample)
STATIC void machine_i2s_feed_dma(machine_i2s_obj_t *self, machine_i2s_dma_buffer_ping_pong_t dma_ping_pong) {
    
    mp_buffer_info_t bufinfo;
    
    // is a sample buffer actively being emptied?
    // if not try to pull one from the active queue
    
    if (self->active_buffer == NULL) {  // TODO rename active_buffer ?  
        // try to pull new sample buffer from the queue
        if (!isEmpty(&self->active_queue)) {  // TODO better name for active_queue?  sample_queue?
            mp_obj_t sample_buffer = dequeue(&self->active_queue);
            self->active_buffer = sample_buffer;
            self->active_buffer_index = 0;
        } else {
            // no samples to 
            // TODO (?) fill dma buffer with zeros as there was no sample data to fill it
            // this would produce silence audio when no more sample data is available
            printf("Received no new data and ran out of buffers. DMA won't be updated!");
            return;
        }
    }
    
