rf-eng/micropython/ports/stm32/machine_i2s.c
#if 0
            // Workaround fix for streaming methods...
            // For streaming methods with a file based stream, I2S DMA IRQ priority must be lower than the SDIO DMA IRQ priority.
            // Explanation:
            //      i2s_stream_handler() is called in the I2S DMA IRQ handler context.
            //      SD Card reads (SDIO peripheral) are called in i2s_stream_handler() using DMA.
            //      When a block of SD card data is finished being read the
            //      SDIO DMA IRQ handler is never run because the I2S DMA IRQ handler is currently running
            //      and both IRQs have the same NVIC priority - as setup in dma_init().
            //      The end result is that i2s_stream_handler() gets "stuck" in an endless loop, in sdcard_wait_finished().
            //      This happens on the 2nd call to i2s_stream_handler().
            // The following two lines are a workaround to correct this problem.
            // When the priority of SDIO DMA IRQ is greater than
            // I2S DMA IRQ the SDIO DMA IRQ handler will interrupt the I2S DMA IRQ handler, allowing sdcard_wait_finished()
            // to complete.  Lower number implies higher interrupt priority
            // TODO figure out a more elegant way to solve this problem.
            // Investigate:  use the 1/2 complete DMA callback to execute stream read()

            // set I2S Tx DMA interrupt priority
            if (i2s_obj->i2s_id == 1) {
                NVIC_SetPriority(DMA2_Stream5_IRQn, (IRQ_PRI_DMA+1));
                HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);
            } else if (i2s_obj->i2s_id == 2) {
                NVIC_SetPriority(DMA1_Stream4_IRQn, (IRQ_PRI_DMA+1));
                HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
            } else {
                // invalid i2s_id number; shouldn't get here as i2s object should not
                // have been created without setting a valid i2s instance number
                return false;
            }
#endif
        }
        return true;
    } else {
        return false;
    }
}
    
#if 0
STATIC mp_obj_t machine_i2s_deinit(mp_obj_t self_in);
void i2s_deinit(void) {
    for (int i = 0; i < MP_ARRAY_SIZE(MP_STATE_PORT(pyb_i2s_obj_all)); i++) {
        machine_i2s_obj_t *i2s_obj = MP_STATE_PORT(pyb_i2s_obj_all)[i];
        if (i2s_obj != NULL) {
            machine_i2s_deinit(i2s_obj);
        }
    }
}
#endif

void AUDIO_ERRORCALLBACK(AUDIO_HANDLE_TYPEDEF *hi2s) {
    uint32_t errorCode = AUDIO_GETERROR(hi2s);
    printf("Audio Error = %ld\n", errorCode);
}

void AUDIO_RXCPLTCALLBACK(AUDIO_HANDLE_TYPEDEF *hi2s) {
    machine_i2s_obj_t *self;
    if (hi2s->Instance == AUDIO_INSTANCE_1) {
        self = &(machine_i2s_obj)[0];
    } else {
        self = &(machine_i2s_obj)[1];
    }
    // bottom half of buffer now filled, 
    // safe to empty the bottom half while the top half of buffer is being filled
    machine_i2s_empty_dma(self, BOTTOM_HALF);  // TODO check with =S= vs uPy coding rules.  is machine_i2s prefix really needed for STATIC?
}     
    
void AUDIO_RXHALFCPLTCALLBACK(AUDIO_HANDLE_TYPEDEF *hi2s) {
    //printf("in rx half cplt callback");
    machine_i2s_obj_t *self;
    if (hi2s->Instance == AUDIO_INSTANCE_1) {
        self = &(machine_i2s_obj)[0];
    } else {
        self = &(machine_i2s_obj)[1];
    }
    // top half of buffer now filled, 
    // safe to empty the top  half while the bottom half of buffer is being filled
    machine_i2s_empty_dma(self, TOP_HALF);  // TODO check with =S= vs uPy coding rules.  is machine_i2s prefix really needed for STATIC?
}

void AUDIO_TXCPLTCALLBACK(AUDIO_HANDLE_TYPEDEF *hi2s) {
    //printf("in tx cplt callback");
    machine_i2s_obj_t *self;
    if (hi2s->Instance == AUDIO_INSTANCE_1) {
        self = &(machine_i2s_obj)[0];
    } else {
        self = &(machine_i2s_obj)[1];
    }
    // bottom half of buffer now emptied, 
    // safe to fill the bottom half while the top half of buffer is being emptied
    machine_i2s_feed_dma(self, BOTTOM_HALF);  // TODO check with =S= vs uPy coding rules.  is machine_i2s prefix really needed for STATIC?
}

void AUDIO_TXHALFCPLTCALLBACK(AUDIO_HANDLE_TYPEDEF *hi2s) {
    machine_i2s_obj_t *self;
    if (hi2s->Instance == AUDIO_INSTANCE_1) {
        self = &(machine_i2s_obj)[0];
    } else {
        self = &(machine_i2s_obj)[1];
    }    
    // top half of buffer now emptied, 
    // safe to fill the top  half while the bottom half of buffer is being emptied
    machine_i2s_feed_dma(self, TOP_HALF);  // TODO check with =S= vs uPy coding rules.  is machine_i2s prefix really needed for STATIC?
}

STATIC void machine_i2s_init_helper(machine_i2s_obj_t *self, size_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum {
        ARG_sck,
        ARG_ws,
        ARG_sd,
        ARG_mode,
        ARG_bits,
        ARG_format,
        ARG_rate,
        ARG_buffers,
        ARG_callback,
    };

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_sck,              MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_ws,               MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_sd,               MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_mode,             MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_bits,             MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_format,           MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_rate,             MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_buffers,          MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_callback,         MP_ARG_KW_ONLY |                   MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    
