rf-eng/micropython/ports/stm32/machine_i2s.c
    // set the I2S configuration values
    memset(&self->i2s, 0, sizeof(self->i2s));
    
    queueInit(&self->active_queue);
    queueInit(&self->idle_queue);

    //
    // ---- Check validity of arguments ----
    //

    // are I2S pin assignments valid?
    const pin_af_obj_t *pin_af;

    // is SCK valid?
    if (mp_obj_is_type(args[ARG_sck].u_obj, &pin_type)) {
        pin_af = pin_find_af(args[ARG_sck].u_obj, AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_CK) {
            //mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid SCK pin for I2S%d"), self->i2s_id);
        }
    } else {
        //mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SCK not a Pin type"));
    }
    
    // is WS valid?
    if (mp_obj_is_type(args[ARG_ws].u_obj, &pin_type)) {
        pin_af = pin_find_af(args[ARG_ws].u_obj, AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_WS) {
            //mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid WS pin for I2S%d"), self->i2s_id);
        }
    } else {
        //mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("WS not a Pin type"));
    }
    
    // is SD valid?
    if (mp_obj_is_type(args[ARG_sd].u_obj, &pin_type)) {
        pin_af = pin_find_af(args[ARG_sd].u_obj, AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_SD) {
            //mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid SD pin for I2S%d"), self->i2s_id);
        }
    } else {
        //mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SD not a Pin type"));
    }

    // is Mode valid?
    uint16_t i2s_mode = args[ARG_mode].u_int;
    if ((i2s_mode != (I2S_MODE_MASTER_RX)) &&
        (i2s_mode != (I2S_MODE_MASTER_TX))) {
        mp_raise_ValueError(MP_ERROR_TEXT("Mode is not valid"));
    }
    
    // is Bits valid?
    int8_t i2s_bits_per_sample = -1;
    // TODO add 24 bits -- audio folks will expect to see this
    if (args[ARG_bits].u_int == 16) { i2s_bits_per_sample = (int8_t)I2S_DATAFORMAT_16B; }
    else if (args[ARG_bits].u_int == 32) { i2s_bits_per_sample = (int8_t)I2S_DATAFORMAT_32B; }
    else { 
        mp_raise_ValueError(MP_ERROR_TEXT("Bits is not valid"));
    }
    
    // is Format valid?
    machine_i2s_format_t i2s_format = args[ARG_format].u_int;
    if ((i2s_format != MONO) &&
        (i2s_format != STEREO)) {
        mp_raise_ValueError(MP_ERROR_TEXT("Format is not valid"));
    }

    // is Sample Rate valid?
    // No validation done:  TODO can it be validated?
    
    // are Buffers valid?
    // buffers are contained in a list or tuple
    // check that type is a list or tuple
    if (mp_obj_is_type(args[ARG_buffers].u_obj, &mp_type_tuple) || mp_obj_is_type(args[ARG_buffers].u_obj, &mp_type_list)) {
        mp_uint_t len = 0;
        mp_obj_t *elem;
        mp_obj_get_array(args[ARG_buffers].u_obj, &len, &elem);
        
        if (len > QUEUE_CAPACITY) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("Num buffers exceeded, max is %d"), QUEUE_CAPACITY);
        }
        
        // add buffers to the idle queue
        for (uint16_t i=0; i<len; i++) {
            // check for valid buffer
            mp_buffer_info_t bufinfo;
            mp_get_buffer_raise(elem[i], &bufinfo, MP_BUFFER_RW);
            
            // add buffer to idle queue 
            enqueue(&self->idle_queue, elem[i]);
        }
    } else {
        mp_raise_TypeError(MP_ERROR_TEXT("Buffers must be contained in a list or tuple"));
    }

    // is callback valid?
    //printf("callable = %d\n", mp_obj_is_callable(args[ARG_callback].u_obj));  // TODO test with no callback
    // TODO raise exception if callback is bogus ?
    
    (*self).dma_buffer = &dma_buffer_reini[0];

    self->sck = args[ARG_sck].u_obj;
    self->ws = args[ARG_ws].u_obj;
    self->sd = args[ARG_sd].u_obj;
    self->mode = i2s_mode;
    self->bits = i2s_bits_per_sample;
    self->format = i2s_format;
    self->rate = args[ARG_rate].u_int;
    self->callback = args[ARG_callback].u_obj;

    #if defined (USE_SAI)
    SAI_InitTypeDef *init = &self->i2s.Init;
    SAI_FrameInitTypeDef *frameinit = &self->i2s.FrameInit;
    SAI_SlotInitTypeDef *slotinit = &self->i2s.SlotInit;
    init->Protocol = SAI_FREE_PROTOCOL;
    init->AudioMode = SAI_MODESLAVE_TX;
    init->DataSize = SAI_DATASIZE_16;
    init->FirstBit = SAI_FIRSTBIT_MSB;
    init->ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
    init->Synchro = SAI_SYNCHRONOUS;
    init->OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
    init->FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY;
    init->SynchroExt = SAI_SYNCEXT_DISABLE;
    init->MonoStereoMode = SAI_STEREOMODE;
    init->CompandingMode = SAI_NOCOMPANDING;
    init->TriState = SAI_OUTPUT_NOTRELEASED;
    init->PdmInit.Activation = DISABLE;
    init->PdmInit.MicPairsNbr = 1;
    init->PdmInit.ClockEnable = SAI_PDM_CLOCK1_ENABLE;
    frameinit->FrameLength = 32;
    frameinit->ActiveFrameLength = 1;
    frameinit->FSDefinition = SAI_FS_STARTFRAME;
    frameinit->FSPolarity = SAI_FS_ACTIVE_HIGH;
    frameinit->FSOffset = SAI_FS_FIRSTBIT;
    slotinit->FirstBitOffset = 0;
    slotinit->SlotSize = SAI_SLOTSIZE_DATASIZE;
    slotinit->SlotNumber = 2;
    slotinit->SlotActive = 0x0000FFFF;
    #else
    I2S_InitTypeDef *init = &self->i2s.Init;
    init->Mode = i2s_mode;
    init->Standard   = I2S_STANDARD_PHILIPS;
    init->DataFormat = i2s_bits_per_sample;
    init->MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
    init->AudioFreq  = args[ARG_rate].u_int;
    init->CPOL       = I2S_CPOL_LOW;
    init->ClockSource = I2S_CLOCK_PLL; 
    #endif
    
    // init the I2S bus
    if (!i2s_init(self)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S port %d init failed"), self->i2s_id);
    }
    
    self->used = true;
}

/******************************************************************************/
// MicroPython bindings for I2S
STATIC void machine_i2s_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_i2s_obj_t *self = MP_OBJ_TO_PTR(self_in);
    
    qstr mode = 0;
    if (self->mode == I2S_MODE_MASTER_RX) { mode = MP_QSTR_RX; }
    else if (self->mode == I2S_MODE_MASTER_TX) { mode = MP_QSTR_TX; }
    else { /* shouldn't get here */ }
    
    uint8_t bits = 0;
    if (self->bits == I2S_DATAFORMAT_16B) { bits = 16; }
    else if (self->bits == I2S_DATAFORMAT_24B) { mode = 24; }
    else if (self->bits == I2S_DATAFORMAT_32B) { mode = 32; }
    else { /* shouldn't get here */ }
    
    // TODO add self->format
    
    mp_printf(print, "I2S(id=%u, sck=%q, ws=%q, sd=%q\n"
            "mode=%q, bits=%u, rate=%d)\n",
            self->i2s_id, self->sck->name, self->ws->name, self->sd->name,
            mode, bits, self->rate
            );
}

