rf-eng/micropython/ports/stm32/machine_i2s.c
#if 0
    if (isEmpty(&self->active_queue) && self->mode == I2S_MODE_MASTER_TX) {
        mp_raise_ValueError(MP_ERROR_TEXT("Nothing to transmit"));
        // TODO - might be OK to start and just send empty dma_buffer (TODO:  clear it first)
        // and then later have putbuffer fill it
    }
    
    if (isEmpty(&self->idle_queue) && self->mode == I2S_MODE_MASTER_RX) {
        mp_raise_ValueError(MP_ERROR_TEXT("No buffer for read"));
        // TODO - might be OK to start and just receive into empty dma_buffer
        // and then later have readinto empty it
    }
#endif
    
    // TODO seems to be a huge amount of coupling between queues and machine_i2s_feed_dma()
    if (self->mode == I2S_MODE_MASTER_TX) {
        mp_obj_t sample_buffer = dequeue(&self->active_queue);
        self->active_buffer = sample_buffer;
        mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);
    } else {  // RX
        mp_obj_t sample_buffer = dequeue(&self->idle_queue);
        self->active_buffer = sample_buffer;
        mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);
    }


    // start DMA.  DMA is configured to run continuously, using a circular buffer configuration
    uint16_t number_of_samples = 0;
    if (self->bits == I2S_DATAFORMAT_16B) {
        number_of_samples = SIZEOF_DMA_BUFFER_IN_BYTES / 2;
    } else {  // 32 bits
        number_of_samples = SIZEOF_DMA_BUFFER_IN_BYTES / 4;
    }
    HAL_StatusTypeDef status;

    if (self->mode == I2S_MODE_MASTER_TX) {
        #if defined (USE_SAI)
        // Configure MPU
        uint32_t irq_state = mpu_config_start();
        mpu_config_region(MPU_REGION_ETH, (uint32_t)&dma_buffer_reini[0], MPU_CONFIG_ETH(MPU_REGION_SIZE_16KB));
        mpu_config_end(irq_state);
        #endif
        machine_i2s_feed_dma(self, TOP_HALF);  // TODO is machine_i2s prefix really desirable for STATIC?
        machine_i2s_feed_dma(self, BOTTOM_HALF);
        status = AUDIO_TX_DMA(&self->i2s, (void *)self->dma_buffer, number_of_samples);
    } else {  // RX      
        status = AUDIO_RX_DMA(&self->i2s, (void *)self->dma_buffer, number_of_samples);        
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
    
    return mp_const_none;
    
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_i2s_start_obj, machine_i2s_start);


STATIC mp_obj_t machine_i2s_deinit(mp_obj_t self_in) {
    machine_i2s_obj_t *self = self_in;
    if (self->used) {
        dma_deinit(self->tx_dma_descr);
        dma_deinit(self->rx_dma_descr);
        HAL_AUDIO_DEINIT(&self->i2s);
        self->used = false;
    }
    
    #if defined (USE_SAI)
        __HAL_RCC_SAI1_CLK_DISABLE();
    #else
    if (self->i2s.Instance == I2S1) {
        __SPI1_FORCE_RESET();
        __SPI1_RELEASE_RESET();
        __SPI1_CLK_DISABLE();
    } else if (self->i2s.Instance == I2S2) {
        __SPI2_FORCE_RESET();
        __SPI2_RELEASE_RESET();
        __SPI2_CLK_DISABLE();
    }
    #endif

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_i2s_deinit_obj, machine_i2s_deinit);


#if MEASURE_COPY_PERFORMANCE
STATIC mp_obj_t machine_i2s_copytest(mp_uint_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_bufsource, ARG_bufdest, ARG_option };
    STATIC const mp_arg_t allowed_args[] = {
        { MP_QSTR_bufsource, MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,  {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_bufdest,   MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,  {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_option,    MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,  {.u_int = 1} },
    };
    
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(args), allowed_args, args);
    
    mp_buffer_info_t bufsource;
    mp_get_buffer_raise(args[ARG_bufsource].u_obj, &bufsource, MP_BUFFER_READ);
    
    mp_buffer_info_t bufdest;
    mp_get_buffer_raise(args[ARG_bufdest].u_obj, &bufdest, MP_BUFFER_WRITE);
    
    uint16_t option = args[ARG_option].u_int;
    uint32_t t0 = 0;
    uint32_t t1 = 0;
        
    if (option == 1) {
        t0 = mp_hal_ticks_us();
        memcpy(bufdest.buf,
               bufsource.buf, 
               bufsource.len);
        t1 = mp_hal_ticks_us();
    } else if (option == 2) {
        t0 = mp_hal_ticks_us();
        for (uint32_t i=0; i<bufsource.len; i++) {
            ((uint8_t *)bufdest.buf)[i] = ((uint8_t *)bufsource.buf)[i]; 
        }
        t1 = mp_hal_ticks_us();
    } else if (option == 3) {
        t0 = mp_hal_ticks_us();
        uint8_t *dest_ptr = (uint8_t *)bufdest.buf;
        uint8_t *source_ptr = (uint8_t *)bufsource.buf;
        for (uint32_t i=0; i<bufsource.len; i++) {
            *dest_ptr++ = *source_ptr++; 
        }
        t1 = mp_hal_ticks_us();
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Invalid copy option"));
    }
    
    return mp_obj_new_int_from_uint(t1-t0);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2s_copytest_obj, 1, machine_i2s_copytest);
#endif

STATIC const mp_rom_map_elem_t machine_i2s_locals_dict_table[] = {
    // Methods
    { MP_ROM_QSTR(MP_QSTR_init),            MP_ROM_PTR(&machine_i2s_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_getbuffer),       MP_ROM_PTR(&machine_i2s_getbuffer_obj) },
    { MP_ROM_QSTR(MP_QSTR_putbuffer),       MP_ROM_PTR(&machine_i2s_putbuffer_obj) },
    { MP_ROM_QSTR(MP_QSTR_start),           MP_ROM_PTR(&machine_i2s_start_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit),          MP_ROM_PTR(&machine_i2s_deinit_obj) },
#if MEASURE_COPY_PERFORMANCE
    { MP_ROM_QSTR(MP_QSTR_copytest),       MP_ROM_PTR(&machine_i2s_copytest_obj) },
#endif     
    
    // TODO add separate callback() method to configure a callback?  research uPy conventions
    
    // TODO when "getbuffer" is implemented be sure to initialize the buf with zeros, to eliminate
    // residual samples that might come into play for a TX situation where we are reading
    // a SD Card file and there is a partial fill at the end of the file.

    // Constants
    { MP_ROM_QSTR(MP_QSTR_RX),              MP_ROM_INT(I2S_MODE_MASTER_RX) },
    { MP_ROM_QSTR(MP_QSTR_TX),              MP_ROM_INT(I2S_MODE_MASTER_TX) },
    { MP_ROM_QSTR(MP_QSTR_STEREO),          MP_ROM_INT(STEREO) },
    { MP_ROM_QSTR(MP_QSTR_MONO),            MP_ROM_INT(MONO) },
};
MP_DEFINE_CONST_DICT(machine_i2s_locals_dict, machine_i2s_locals_dict_table);

const mp_obj_type_t machine_i2s_type = {
    { &mp_type_type },
    .name = MP_QSTR_I2S,
    .print = machine_i2s_print,
    .make_new = machine_i2s_make_new,
    .locals_dict = (mp_obj_dict_t *) &machine_i2s_locals_dict,
};
